//Definition
//-------------------------
/************************************************************************
 * FUNCTION : IMU加速度生値->物理値変換
 * INPUT    : IMU加速度生値
 * OUTPUT   : 加速度(m/s^2)
 ***********************************************************************/
 float convertRawAcceleration(int aRaw)
 {
    float a = (aRaw * 2.0 * 9.80665) / 32768.0;
    return a;
 }
 
 /************************************************************************
  * FUNCTION : IMU角速度生値->物理値変換
  * INPUT    : IMU角速度生値
  * OUTPUT   : 角速度(deg/s)
  ***********************************************************************/
 float convertRawGyro(int gRaw)
 {
    float g = (gRaw * 500.0f) / 32768.0;
    return g;
 }